README.md
```mermaid
classDiagram
    class MovieController {
        +getAllMovies(): List~Movie~
        +getMovieById(long): Movie
    }
    class BookingController {
        +blockSeats(BlockSeatRequestDto): boolean
        +confirmBooking(BookSeatRequestDto): Optional~Ticket~
        +clearAllSeatLocked(): void
    }
    class MovieServiceImpl {
        +findAllMovies(): List~Movie~
        +findMoviesById(long): Optional~Movie~
    }
    class RedisBookingService {
        +blockSeats(long, List~Long~, long): boolean
        +bookTicket(long, List~Long~, long): Optional~Ticket~
        +clearAllSeatLocks(): void
    }
    class RedisService {
        +set(String, Object): void
        +get(String): Object
        +delete(String): void
        +getAllkey(): void
    }
    class RedisConfig {
        +redisConnectionFactory(): JedisConnectionFactory
        +redisTemplate(): RedisTemplate~String, String~
    }
    class BlockSeatRequestDto {
        +showId: long
        +userId: long
        +seatId: List~Long~
    }
    class BookSeatRequestDto {
        +showId: long
        +userId: long
        +seatId: List~Long~
    }
    class Movie {
        +name: String
        +poster: String
    }
    class Show {
        +startTime: Date
        +endTime: Date
    }
    class Seat {
        +seatNumber: String
        +rowValue: int
        +columnValue: int
    }
    class ShowSeat {
        +status: ShowSeatStatus
    }
    class Ticket {
        +amount: int
        +status: TicketStatus
    }
    class User {
        +name: String
        +email: String
    }
    class City {
        +name: String
    }
    class Theatre {
        +name: String
        +address: String
    }
    class Auditorium {
        +name: String
        +capacity: int
    }
    class BaseModel {
        +Id: Long
        +createdAt: Date
        +updatedAt: Date
    }

    MovieController --> MovieServiceImpl
    BookingController --> RedisBookingService
    MovieServiceImpl --> MovieRepository
    RedisBookingService --> ShowSeatRepository
    RedisBookingService --> ShowRepository
    RedisBookingService --> TicketRepository
    RedisBookingService --> UserRepository
    RedisBookingService --> RedisService
    RedisService --> RedisConfig
    RedisConfig --> RedisTemplate
    RedisConfig --> JedisConnectionFactory

    Movie --> Show
    Show --> Movie
    Show --> Auditorium
    Show --> ShowSeat
    ShowSeat --> Seat
    ShowSeat --> Ticket
    Ticket --> User
    Ticket --> Show
    Seat --> Auditorium
    Auditorium --> Theatre
    Theatre --> City

    BaseModel <|-- Movie
    BaseModel <|-- Show
    BaseModel <|-- Seat
    BaseModel <|-- ShowSeat
    BaseModel <|-- Ticket
    BaseModel <|-- User
    BaseModel <|-- City
    BaseModel <|-- Theatre
    BaseModel <|-- Auditorium
```
